Revit 2026 API

# ImageBackgroundSettingsBackgroundImageFit Property

---

The background image fit type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BackgroundImageFit BackgroundImageFit { get; set; }
```
```vb
Public Property BackgroundImageFit As BackgroundImageFit
	Get
	Set
```
```cpp
public:
property BackgroundImageFit BackgroundImageFit {
	BackgroundImageFit get ();
	void set (BackgroundImageFit value);
}
```
```fsharp
member BackgroundImageFit : BackgroundImageFit with get, set
```

#### Property Value

BackgroundImageFit

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This value indicates how scale should be applied to the image in order to fit it to a page or screen.

#### Reference

ImageBackgroundSettings Class

Autodesk.Revit.DB Namespace